In [3]:
import pandas as pd
import numpy as np
df2 = pd.DataFrame({'A': 1.,
 'B': pd.Timestamp('20130102'),
 'C': pd.Series(1, index=list(range(4)), dtype='float32'),
 'D': np.array([3] * 4, dtype='int32'),
 'E': pd.Categorical(["test", "train", "test", "train"]),
 'F': 'foo'})

In [4]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [8]:
df2.to_dict()

{'A': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0},
 'B': {0: Timestamp('2013-01-02 00:00:00'),
  1: Timestamp('2013-01-02 00:00:00'),
  2: Timestamp('2013-01-02 00:00:00'),
  3: Timestamp('2013-01-02 00:00:00')},
 'C': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0},
 'D': {0: 3, 1: 3, 2: 3, 3: 3},
 'E': {0: 'test', 1: 'train', 2: 'test', 3: 'train'},
 'F': {0: 'foo', 1: 'foo', 2: 'foo', 3: 'foo'}}

In [9]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [10]:
df

                   A         B         C         D
2013-01-01  2.000081  0.935461  1.090941 -1.146657
2013-01-02  0.098742  1.490163 -0.369401  0.500661
2013-01-03 -1.193655 -1.074562  2.442444  1.149055
2013-01-04  1.671154 -0.912912  0.469346  0.754985
2013-01-05  0.040705 -0.422505  0.278316 -0.074483
2013-01-06 -1.410640  1.320261 -0.910062 -0.282351

In [11]:
df[1:3]

                   A         B         C         D
2013-01-02  0.098742  1.490163 -0.369401  0.500661
2013-01-03 -1.193655 -1.074562  2.442444  1.149055

In [12]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.098742  1.490163 -0.369401  0.500661
2013-01-03 -1.193655 -1.074562  2.442444  1.149055
2013-01-04  1.671154 -0.912912  0.469346  0.754985

In [13]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.098742 -0.369401
2013-01-03 -1.193655  2.442444
2013-01-05  0.040705  0.278316